<template>
  <div>
    <h1>2017년 분기별 매출</h1>
    <p>q1: {{ sales_2017.q1 }} n1: {{ sales_2017.n1 }}</p>
    <p>q2: {{ sales_2017.q2 }} n2: {{ sales_2017.n2 }}</p>
    <p>q3: {{ sales_2017.q3 }} n3: {{ sales_2017.n3 }}</p>
    <p>q4: {{ sales_2017.q4 }} n4: {{ sales_2017.n4 }}</p><hr>
    <!-- <h1>연 평균 성장률</h1>
    <h1>{{ growth_rate.average_rate }}</h1> -->

  </div>
</template>

<script>
import axios from 'axios'

export default {
  data: () => {
    return {
      key: '진관동',
      sales_2018: {
        'q1': 0,
        'q2': 0,
        'q3': 0,
        'q4': 0,
        'n1': 0,
        'n2': 0,
        'n3': 0,
        'n4': 0,
        'classification': {
          'CS100001': { 'name': '한국음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100002': { 'name': '중식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100003': { 'name': '일식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100004': { 'name': '양식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100005': { 'name': '분식전문점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100006': { 'name': '패스트푸드', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100008': { 'name': '제과점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100009': { 'name': '카페', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200001': { 'name': '일반교습학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200005': { 'name': '한의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200009': { 'name': '숙박업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200016': { 'name': '미용업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300001': { 'name': '슈퍼마켓', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300002': { 'name': '편의점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300007': { 'name': '의류점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300008': { 'name': '패션용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300010': { 'name': '서적·문구', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300011': { 'name': '화장품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300012': { 'name': '오락·운동', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300013': { 'name': '섬유제품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300016': { 'name': '주방·가정용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100010': { 'name': '호프·간이주점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200013': { 'name': '세탁소', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200014': { 'name': '스포츠클럽', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200017': { 'name': '네일숍', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300004': { 'name': '핸드폰', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300015': { 'name': '가구·가전', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300009': { 'name': '의약·의료용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300017': { 'name': '통신판매업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200003': { 'name': '예체능학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200012': { 'name': '당구장', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300005': { 'name': '식료품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300006': { 'name': '건강보조식품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300014': { 'name': '화초·애완', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100007': { 'name': '치킨전문점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200004': { 'name': '치과의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200006': { 'name': '일반의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200007': { 'name': '가전제품수리', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200011': { 'name': 'PC방', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200002': { 'name': '외국어학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200015': { 'name': '자동차수리·세차', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200018': { 'name': '피부관리실', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200010': { 'name': '노래방', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200008': { 'name': '부동산중개업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300003': { 'name': '컴퓨터·주변기기', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 }
        }
      },
      sales_2017: {
        'q1': 0,
        'q2': 0,
        'q3': 0,
        'q4': 0,
        'n1': 0,
        'n2': 0,
        'n3': 0,
        'n4': 0,
        'classification': {
          'CS100001': { 'name': '한국음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100002': { 'name': '중식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100003': { 'name': '일식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100004': { 'name': '양식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100005': { 'name': '분식전문점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100006': { 'name': '패스트푸드', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100008': { 'name': '제과점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100009': { 'name': '카페', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200001': { 'name': '일반교습학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200005': { 'name': '한의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200009': { 'name': '숙박업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200016': { 'name': '미용업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300001': { 'name': '슈퍼마켓', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300002': { 'name': '편의점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300007': { 'name': '의류점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300008': { 'name': '패션용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300010': { 'name': '서적·문구', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300011': { 'name': '화장품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300012': { 'name': '오락·운동', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300013': { 'name': '섬유제품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300016': { 'name': '주방·가정용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100010': { 'name': '호프·간이주점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200013': { 'name': '세탁소', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200014': { 'name': '스포츠클럽', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200017': { 'name': '네일숍', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300004': { 'name': '핸드폰', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300015': { 'name': '가구·가전', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300009': { 'name': '의약·의료용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300017': { 'name': '통신판매업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200003': { 'name': '예체능학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200012': { 'name': '당구장', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300005': { 'name': '식료품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300006': { 'name': '건강보조식품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300014': { 'name': '화초·애완', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100007': { 'name': '치킨전문점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200004': { 'name': '치과의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200006': { 'name': '일반의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200007': { 'name': '가전제품수리', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200011': { 'name': 'PC방', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200002': { 'name': '외국어학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200015': { 'name': '자동차수리·세차', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200018': { 'name': '피부관리실', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200010': { 'name': '노래방', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200008': { 'name': '부동산중개업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300003': { 'name': '컴퓨터·주변기기', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 }
        }
      },
      sales_2016: {
        'q1': 0,
        'q2': 0,
        'q3': 0,
        'q4': 0,
        'n1': 0,
        'n2': 0,
        'n3': 0,
        'n4': 0,
        'classification': {
          'CS100001': { 'name': '한국음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100002': { 'name': '중식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100003': { 'name': '일식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100004': { 'name': '양식음식점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100005': { 'name': '분식전문점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100006': { 'name': '패스트푸드', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100008': { 'name': '제과점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100009': { 'name': '카페', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200001': { 'name': '일반교습학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200005': { 'name': '한의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200009': { 'name': '숙박업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200016': { 'name': '미용업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300001': { 'name': '슈퍼마켓', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300002': { 'name': '편의점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300007': { 'name': '의류점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300008': { 'name': '패션용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300010': { 'name': '서적·문구', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300011': { 'name': '화장품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300012': { 'name': '오락·운동', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300013': { 'name': '섬유제품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300016': { 'name': '주방·가정용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100010': { 'name': '호프·간이주점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200013': { 'name': '세탁소', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200014': { 'name': '스포츠클럽', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200017': { 'name': '네일숍', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300004': { 'name': '핸드폰', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300015': { 'name': '가구·가전', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300009': { 'name': '의약·의료용품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300017': { 'name': '통신판매업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200003': { 'name': '예체능학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200012': { 'name': '당구장', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300005': { 'name': '식료품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300006': { 'name': '건강보조식품', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300014': { 'name': '화초·애완', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS100007': { 'name': '치킨전문점', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200004': { 'name': '치과의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200006': { 'name': '일반의원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200007': { 'name': '가전제품수리', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200011': { 'name': 'PC방', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200002': { 'name': '외국어학원', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200015': { 'name': '자동차수리·세차', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200018': { 'name': '피부관리실', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200010': { 'name': '노래방', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS200008': { 'name': '부동산중개업', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 },
          'CS300003': { 'name': '컴퓨터·주변기기', 'q1': 0, 'q2': 0, 'q3': 0, 'q4': 0, 'n1': 0, 'n2': 0, 'n3': 0, 'n4': 0 }
        }
      },
      sales_change_rate_2018: { 'c1': 0, 'c2': 0, 'c3': 0, 'c4': 0 },
      sales_change_rate_2017: { 'c1': 0, 'c2': 0, 'c3': 0, 'c4': 0 },
      growth_rate: {
        'average_rate': 0
      },
      score: {
        '성장성': '',
        '안정성': '',
        '영업력': '',
        '구매력': '',
        '집객력': ''
      }
    }
  },
  created () {
    // 업종 및 분기별 매출 + 점포 수
    const requestSalesUrl = 'http://70.12.247.78:8080/sales/' + this.key
    axios.get(requestSalesUrl)
      .then(res => {
        for (let index = 0; index < res.data.length; index++) {
          let temp = res.data[index]
          // console.log(temp)
          let serviceCode = temp.e
          if (Number(temp.af) !== 0) {
            if (temp.a === '1') {
              this.sales_2017.q1 += Number(temp.g)
              this.sales_2017.n1 += Number(temp.af)
              this.sales_2017.classification[serviceCode].q1 += Number(temp.g)
              this.sales_2017.classification[serviceCode].n1 += Number(temp.af)
            } else if (temp.a === '2') {
              this.sales_2017.q2 += Number(temp.g)
              this.sales_2017.n2 += Number(temp.af)
              this.sales_2017.classification[serviceCode].q2 += Number(temp.g)
              this.sales_2017.classification[serviceCode].n2 += Number(temp.af)
            } else if (temp.a === '3') {
              this.sales_2017.q3 += Number(temp.g)
              this.sales_2017.n3 += Number(temp.af)
              this.sales_2017.classification[serviceCode].q3 += Number(temp.g)
              this.sales_2017.classification[serviceCode].n3 += Number(temp.af)
            } else {
              this.sales_2017.q4 += Number(temp.g)
              this.sales_2017.n4 += Number(temp.af)
              this.sales_2017.classification[serviceCode].q4 += Number(temp.g)
              this.sales_2017.classification[serviceCode].n4 += Number(temp.af)
            }
          }
          // if (temp.a === '2018') {
          //   if (temp.b === '1') {
          //     this.sales_2018.q1 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].q1 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].n1 += Number(temp.af)
          //   } else if (temp.b === '2') {
          //     this.sales_2018.q2 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].q2 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].n2 += Number(temp.af)
          //   } else if (temp.b === '3') {
          //     this.sales_2018.q3 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].q3 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].n3 += Number(temp.af)
          //   } else {
          //     this.sales_2018.q4 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].q4 += Number(temp.g)
          //     this.sales_2018.classification[serviceCode].n4 += Number(temp.af)
          //   }
          // } else if (temp.a === '2017') {
          //   if (temp.b === '1') {
          //     this.sales_2017.q1 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].q1 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].n1 += Number(temp.af)
          //   } else if (temp.b === '2') {
          //     this.sales_2017.q2 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].q2 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].n2 += Number(temp.af)
          //   } else if (temp.b === '3') {
          //     this.sales_2017.q3 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].q3 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].n3 += Number(temp.af)
          //   } else {
          //     this.sales_2017.q4 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].q4 += Number(temp.g)
          //     this.sales_2017.classification[serviceCode].n4 += Number(temp.af)
          //   }
          // }
        }
      })
      .catch(err => console.log(err))
      .finally(() => {
        // 연 평균 성장률, ( + 연도끼리 비교해야함 )
        // let total2018 = this.sales_2018.q1 + this.sales_2018.q2 + this.sales_2018.q3 + this.sales_2018.q4
        // let total2016 = this.sales_2016.q1 + this.sales_2016.q2 + this.sales_2016.q3 + this.sales_2016.q4
        // this.growth_rate.average_rate = (total2018 / total2016) ** (1 / 3) - 1
        console.log(this.sales_2017.classification)
        // 매출 증감률 ( 작년 대비 )
      })
      // last year
  }
}

</script>

<style></style>
